#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.dns_a_record_set.home_ip: Reading...
data.dns_a_record_set.home_ip: Read complete after 0s [id=ttrygve-mdch.ddns.net]
data.azurerm_dns_zone.main: Reading...
data.azurerm_dns_zone.main: Read complete after 1s [id=/subscriptions/60d56af8-54b4-4505-83b8-d8c95397128e/resourceGroups/rgDns/providers/Microsoft.Network/dnsZones/az.trelvik.net]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_dns_a_record.main will be created
  + resource "azurerm_dns_a_record" "main" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "grafana-dev"
      + records             = (known after apply)
      + resource_group_name = "rgDns"
      + ttl                 = 300
      + zone_name           = "az.trelvik.net"
    }

  # azurerm_dns_cname_record.wildcard will be created
  + resource "azurerm_dns_cname_record" "wildcard" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "*.grafana-dev"
      + record              = (known after apply)
      + resource_group_name = "rgDns"
      + ttl                 = 300
      + zone_name           = "az.trelvik.net"
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-grafana-dev"
      + tags     = {
          + "managed_by" = "Terraform"
          + "project"    = "Observability Stack"
        }
    }

  # module.compute.azurerm_linux_virtual_machine.main will be created
  + resource "azurerm_linux_virtual_machine" "main" {
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = (known after apply)
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = "grafana-dev-vm"
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "grafana-dev-vm"
      + network_interface_ids                                  = (known after apply)
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = (known after apply)
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = (known after apply)
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-grafana-dev"
      + size                                                   = "Standard_B1s"
      + tags                                                   = {
          + "managed_by" = "Terraform"
          + "project"    = "Observability Stack"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + admin_ssh_key {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + id                        = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.compute.azurerm_network_interface.main will be created
  + resource "azurerm_network_interface" "main" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "eastus"
      + mac_address                    = (known after apply)
      + name                           = "grafana-dev-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "rg-grafana-dev"
      + tags                           = {
          + "managed_by" = "Terraform"
          + "project"    = "Observability Stack"
        }
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.compute.azurerm_network_interface_security_group_association.main will be created
  + resource "azurerm_network_interface_security_group_association" "main" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # module.network.azurerm_public_ip.main will be created
  + resource "azurerm_public_ip" "main" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "grafana-dev-pip"
      + resource_group_name     = "rg-grafana-dev"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "managed_by" = "Terraform"
          + "project"    = "Observability Stack"
        }
    }

  # module.network.azurerm_subnet.main will be created
  + resource "azurerm_subnet" "main" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "grafana-dev-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-grafana-dev"
      + virtual_network_name                          = "grafana-dev-vnet"
    }

  # module.network.azurerm_virtual_network.main will be created
  + resource "azurerm_virtual_network" "main" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "eastus"
      + name                           = "grafana-dev-vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-grafana-dev"
      + subnet                         = (known after apply)
      + tags                           = {
          + "managed_by" = "Terraform"
          + "project"    = "Observability Stack"
        }
    }

  # module.security.azurerm_network_security_group.main will be created
  + resource "azurerm_network_security_group" "main" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "grafana-dev-nsg"
      + resource_group_name = "rg-grafana-dev"
      + security_rule       = (known after apply)
      + tags                = {
          + "managed_by" = "Terraform"
          + "project"    = "Observability Stack"
        }
    }

  # module.security.azurerm_network_security_rule.http will be created
  + resource "azurerm_network_security_rule" "http" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowHTTP"
      + network_security_group_name = "grafana-dev-nsg"
      + priority                    = 110
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-grafana-dev"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.security.azurerm_network_security_rule.https will be created
  + resource "azurerm_network_security_rule" "https" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowHTTPS"
      + network_security_group_name = "grafana-dev-nsg"
      + priority                    = 120
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-grafana-dev"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.security.azurerm_network_security_rule.ssh will be created
  + resource "azurerm_network_security_rule" "ssh" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowSSH"
      + network_security_group_name = "grafana-dev-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-grafana-dev"
      + source_address_prefixes     = [
          + "141.156.151.53/32",
        ]
      + source_port_range           = "*"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dashboard_urls = {
      + grafana    = (known after apply)
      + loki       = (known after apply)
      + prometheus = (known after apply)
      + traefik    = (known after apply)
    }
  + fqdn           = (known after apply)
  + ssh_command    = (known after apply)
  + vm_public_ip   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>
*Pushed by: @ttrelvik, Action: `pull_request`*